       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-YEAR      PIC 9(4).
       01 WS-RESULT    PIC 9(1).
       01 WS-REM4      PIC 9(4).
       01 WS-REM100    PIC 9(4).
       01 WS-REM400    PIC 9(4).
       01 WS-DUMMY     PIC 9(4).
       PROCEDURE DIVISION.
       LEAP.
       DIVIDE WS-YEAR BY 4    GIVING WS-DUMMY REMAINDER WS-REM4.
       DIVIDE WS-YEAR BY 100  GIVING WS-DUMMY REMAINDER WS-REM100.
       DIVIDE WS-YEAR BY 400  GIVING WS-DUMMY REMAINDER WS-REM400.
       IF (WS-REM400 = 0) OR (WS-REM4 = 0 AND WS-REM100 NOT = 0)
         MOVE 1 TO WS-RESULT
       ELSE
         MOVE 0 TO WS-RESULT
       END-IF.
         CONTINUE.
       LEAP-EXIT.
         EXIT.
